park-del/-/单片机实践-LPC1768（基于CORTEX-M内核）与 STM32/STM32F103-标准库角度/6-4 PWM驱动舵机/Hardware/PWM.c
#include "stm32f10x.h"                  // Device header

void PWM_Init(void){
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	
	
	GPIO_InitTypeDef GPIO_InitStructure;
 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
 	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	TIM_InternalClockConfig(TIM2);
	
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInitStructure.TIM_Period = 20000 - 1;      //ARR
	TIM_TimeBaseInitStructure.TIM_Prescaler = 72 - 1;      //PSC
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM2,&TIM_TimeBaseInitStructure);
	
	TIM_OCInitTypeDef TIM_OCInitStructure;
	TIM_OCStructInit(&TIM_OCInitStructure);
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_Pulse = 0;   //CCR
	TIM_OC2Init(TIM2,&TIM_OCInitStructure);
	
	// 舵机要求的PMM周期是20ms，则对应的PWM频率就是50Hz，即计数器更新频率为50Hz；
	// 占空比这里，舵机要求的高电平时间是 0.5ms ~ 2.5ms，对应占空比就是
	// 寻找到了一个比较方便计算的值：PSC + 1 = 72，ARR + 1 = 20K，此时满足公式中的第一个等式，
	// 故最终频率为 72MHz/72/20K = 50Hz。此时，计数器CNT从0计数到20K需要20ms，若CCR设置为500，
	// 则对应的高电平时间就是 20ms * 500/20000 = 0.5ms，CCR设置为2500，就是2.5ms。
	
	TIM_Cmd(TIM2,ENABLE);
}


void PWM_SetCompare2(uint16_t Compare){
	TIM_SetCompare2(TIM2,Compare);
}

